; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v10 ?v4)
             (pred_10 ?v6 ?v7)
             (pred_7 ?v10 ?v7)
             (pred_2 ?v9 ?v10 )
	     (pred_1 ?v10)
             (pred_12 ?v1)
             (pred_4 ?v6)
             (pred_6 ?v7)
             (pred_9 ?v10)
             (pred_5 ?v6)
             (pred_3 ?v10)
             (pred_8 ))



(:action op_3
:parameters (?v13 ?v8 ?v3 ?v2)
:precondition (and (pred_12 ?v13) (pred_12 ?v8) (pred_4 ?v3) (pred_6 ?v2)
          (pred_11 ?v13 ?v8) (pred_10 ?v3 ?v2)
                   (pred_7 ?v8 ?v2) (pred_1 ?v13) 
                   (pred_9 ?v8) (pred_5 ?v3))
:effect (and  (pred_3 ?v8) (not (pred_9 ?v8))))


(:action op_4
:parameters (?v13 ?v12)
:precondition (and (pred_12 ?v13) (pred_12 ?v12)
               (pred_1 ?v13) (pred_11 ?v13 ?v12) (pred_3 ?v12))
:effect (and (pred_1 ?v12) (not (pred_1 ?v13))))

(:action op_2
:parameters (?v13 ?v3)
:precondition (and (pred_12 ?v13) (pred_4 ?v3) 
                  (pred_1 ?v13) (pred_2 ?v3 ?v13) (pred_8 ))
:effect (and (pred_5 ?v3)
   (not (pred_2 ?v3 ?v13)) (not (pred_8 ))))


(:action op_5
:parameters (?v13 ?v5 ?v11)
:precondition (and (pred_12 ?v13) (pred_4 ?v5) (pred_4 ?v11)
                  (pred_1 ?v13) (pred_5 ?v11) (pred_2 ?v5 ?v13))
:effect (and (pred_5 ?v5) (pred_2 ?v11 ?v13)
        (not (pred_5 ?v11)) (not (pred_2 ?v5 ?v13))))

(:action op_1
:parameters (?v13 ?v3)
:precondition (and (pred_12 ?v13) (pred_4 ?v3) 
                  (pred_1 ?v13) (pred_5 ?v3))
:effect (and (pred_8 ) (pred_2 ?v3 ?v13) (not (pred_5 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_17 obj_15 obj_04 obj_10 obj_13 obj_16 obj_12 obj_02 obj_01 obj_19 obj_08 obj_05 obj_11 obj_20 obj_03
    obj_14 obj_18
    obj_06 obj_07
    )

    (:init
       (pred_8)

       (pred_12 obj_09)
       (pred_12 obj_17)
       (pred_12 obj_15)
       (pred_12 obj_04)
       (pred_12 obj_10)
       (pred_12 obj_13)
       (pred_12 obj_16)
       (pred_12 obj_12)
       (pred_12 obj_02)
       (pred_12 obj_01)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_05)
       (pred_12 obj_11)
       (pred_12 obj_20)
       (pred_12 obj_03)
       (pred_6 obj_14)
       (pred_6 obj_18)
       (pred_4 obj_06)
       (pred_4 obj_07)

       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_15 obj_04)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_04 obj_15)
       (pred_11 obj_10 obj_02)
       (pred_11 obj_10 obj_13)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_13 obj_01)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_13 obj_17)
       (pred_11 obj_13 obj_10)
       (pred_11 obj_16 obj_19)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_12 obj_08)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_02 obj_05)
       (pred_11 obj_02 obj_01)
       (pred_11 obj_02 obj_10)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_01 obj_13)
       (pred_11 obj_01 obj_02)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_08)
       (pred_11 obj_19 obj_16)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_12)
       (pred_11 obj_08 obj_19)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_02)
       (pred_11 obj_11 obj_20)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_11)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_20)
       (pred_9 obj_11)
       (pred_9 obj_16)
       (pred_7  obj_11 obj_14)
       (pred_7  obj_16 obj_18)
       (pred_3 obj_09)
       (pred_3 obj_17)
       (pred_3 obj_15)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_12)
       (pred_3 obj_02)
       (pred_3 obj_01)
       (pred_3 obj_19)
       (pred_3 obj_08)
       (pred_3 obj_05)
       (pred_3 obj_20)
       (pred_3 obj_03)

       (pred_10  obj_06 obj_14)
       (pred_10  obj_07 obj_18)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_07 obj_08)
       (pred_1 obj_02)
    )

    (:goal (and
       (pred_2 obj_07 obj_10)
    ))
(:constraints
  (always (not (pred_1 obj_19)))
)
)

; plan
1. (op_4 obj_02 obj_10)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_10)
   goals met: 0 of 1
2. (op_4 obj_10 obj_13)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_13)
   goals met: 0 of 1
3. (op_2 obj_13 obj_06)
   deleted: (pred_2 obj_06 obj_13) (pred_8)
   added: (pred_5 obj_06)
   goals met: 0 of 1
4. (op_4 obj_13 obj_01)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_01)
   goals met: 0 of 1
5. (op_3 obj_01 obj_11 obj_06 obj_14)
   deleted: (pred_9 obj_11)
   added: (pred_3 obj_11)
   goals met: 0 of 1
6. (op_4 obj_01 obj_13)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_13)
   goals met: 0 of 1
7. (op_4 obj_13 obj_10)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_10)
   goals met: 0 of 1
8. (op_1 obj_10 obj_06)
   deleted: (pred_5 obj_06)
   added: (pred_8) (pred_2 obj_06 obj_10)
   goals met: 0 of 1
9. (op_4 obj_10 obj_13)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_13)
   goals met: 0 of 1
10. (op_4 obj_13 obj_01)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_01)
   goals met: 0 of 1
11. (op_4 obj_01 obj_11)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_11)
   goals met: 0 of 1
12. (op_4 obj_11 obj_20)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_20)
   goals met: 0 of 1
13. (op_4 obj_20 obj_03)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_03)
   goals met: 0 of 1
14. (op_4 obj_03 obj_08)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_08)
   goals met: 0 of 1
15. (op_2 obj_08 obj_07)
   deleted: (pred_2 obj_07 obj_08) (pred_8)
   added: (pred_5 obj_07)
   goals met: 0 of 1
16. (op_4 obj_08 obj_12)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_12)
   goals met: 0 of 1
17. (op_3 obj_12 obj_16 obj_07 obj_18)
   deleted: (pred_9 obj_16)
   added: (pred_3 obj_16)
   goals met: 0 of 1
18. (op_4 obj_12 obj_16)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_16)
   goals met: 0 of 1
19. (op_4 obj_16 obj_13)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_13)
   goals met: 0 of 1
20. (op_4 obj_13 obj_10)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_10)
   goals met: 0 of 1
21. (op_5 obj_10 obj_06 obj_07)
   deleted: (pred_5 obj_07) (pred_2 obj_06 obj_10)
   added: (pred_5 obj_06) (pred_2 obj_07 obj_10)
   goals met: 1 of 1
